mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
          <variant Dvariant="STM32F767NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767NG'  ***************************** -->
        <device Dname="STM32F767NG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F767NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
          <!-- *************************  Device 'STM32F767II'  ***************************** -->
        <device Dname="STM32F767II">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />
          <variant Dvariant="STM32F767IITx"> <feature type="QFP" n="176"/> </variant>

          <variant Dvariant="STM32F767IIKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767IG'  ***************************** -->
        <device Dname="STM32F767IG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F767IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F767IGKx"> <feature type="BGA" n="176"/> </variant>
        </device>
         <!-- *************************  Device 'STM32F767ZI'  ***************************** -->
        <device Dname="STM32F767ZI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F767ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767ZG'  ***************************** -->
        <device Dname="STM32F767ZG">
          <memory id="IROM1"                                     start="0x08000000" size="0x100000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x100000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_1024.FLM"     start="0x00200000" size="0x100000" default="0" />
		  <algorithm name="CMSIS/Flash/STM32F7x_1024dual.FLM"    start="0x08000000" size="0x100000" default="1" />
		  <algorithm name="CMSIS/Flash/STM32F7xTCM_1024dual.FLM" start="0x00200000" size="0x100000" default="0" />

          <variant Dvariant="STM32F767ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
         <!-- *************************  Device 'STM32F767VI'  ***************************** -->
        <device Dname="STM32F767VI">
          <memory id="IROM1"                                     start="0x08000000" size="0x200000" default="1" startup="1" />
          <memory id="IROM2"                                     start="0x00200000" size="0x200000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" default="0" />

          <variant Dvariant="STM32F767VITx"> <feature type="QFP" n="100"/> </variant>
        </device>
