mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
        <!-- *************************  Device 'STM32F730Z8'  ***************************** -->
        <device Dname="STM32F730Z8">
          <memory id="IROM1"                                start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F730Z8Tx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F730I8'  ***************************** -->
        <device Dname="STM32F730I8">
          <memory id="IROM1"                                start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F730I8Kx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F750'  **************************** -->
      <subFamily DsubFamily="STM32F750">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F750x.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F750xx"/>

        <debugvars configfile="CMSIS/Debug/STM32F74x_75x.dbgconf" version="1.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20010000" size="0x40000"     init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000"     init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F74x_75x_OPT.FLM" start="0x1FFF0000" size="0x0008" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"     start="0x1FF0F000" size="0x0410" default="0"/>

        <book name="Documentation/DM00124865.pdf" title="STM32F74xx/5xx Reference Manual"/>
        <book name="Documentation/stm32f750n8.pdf" title="STM32F750x8 Data Sheet"/>

        <!-- *************************  Device 'STM32F750V8'  ***************************** -->
        <device Dname="STM32F750V8">
          <memory id="IROM1"                                 start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F75x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F75x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F750V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F750Z8'***************************** -->
        <device Dname="STM32F750Z8">
          <memory id="IROM1"                                 start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F75x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F75x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F750Z8Tx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F750N8'  ***************************** -->
        <device Dname="STM32F750N8">
          <memory id="IROM1"                                 start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F75x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F75x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F750N8Hx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the ARM Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7F_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the ARM Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
