mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7">
      <description>STMicroelectronics STM32F7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F7*"/>
    </condition>

    <condition id="STM32F745">
      <description>STMicroelectronics STM32F745 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F745*"/>
    </condition>
    <condition id="STM32F746">
      <description>STMicroelectronics STM32F746 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F746*"/>
    </condition>
    <condition id="STM32F756">
      <description>STMicroelectronics STM32F756 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F756*"/>
    </condition>
    <condition id="STM32F765">
      <description>STMicroelectronics STM32F765 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F765*"/>
    </condition>
    <condition id="STM32F767">
      <description>STMicroelectronics STM32F767 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F767*"/>
    </condition>
    <condition id="STM32F768">
      <description>STMicroelectronics STM32F768 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F768*"/>
    </condition>
    <condition id="STM32F769">
      <description>STMicroelectronics STM32F769 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F769*"/>
    </condition>
    <condition id="STM32F777">
      <description>STMicroelectronics STM32F777 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F777*"/>
    </condition>
    <condition id="STM32F778">
      <description>STMicroelectronics STM32F778 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F778*"/>
    </condition>
    <condition id="STM32F779">
      <description>STMicroelectronics STM32F779 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F779*"/>
    </condition>
    <condition id="STM32F722">
      <description>STMicroelectronics STM32F722 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F722*"/>
    </condition>
    <condition id="STM32F723">
      <description>STMicroelectronics STM32F723 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F723*"/>
    </condition>
    <condition id="STM32F732">
      <description>STMicroelectronics STM32F732 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F732*"/>
    </condition>
    <condition id="STM32F733">
      <description>STMicroelectronics STM32F733 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F733*"/>
    </condition>
    <condition id="STM32F730">
      <description>STMicroelectronics STM32F730 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F730*"/>
    </condition>
    <condition id="STM32F750">
      <description>STMicroelectronics STM32F735 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F750*"/>
    </condition>

    <!--condition id="STM32F7x5_7x6_7x7_7x9_750">
      <description>STMicroelectronics STM32F745/F746/756/765/767/769/777/779/750 Series devices</description>
      <accept  condition="STM32F745"/>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
      <accept  condition="STM32F765"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F779"/>
      <accept  condition="STM32F750"/>
    </condition-->
    <condition id="STM32F7x6_7x7_7x8_7x9_750">
      <description>STMicroelectronics STM32F746/756/767/768/769/777/778/779/750 Series devices</description>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
      <accept  condition="STM32F750"/>
    </condition>
    <condition id="STM32F76x_77x">
      <description>STMicroelectronics STM32F765/767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F765"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F7x8">
      <description>STMicroelectronics STM32F768/778 Series devices</description>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F778"/>
    </condition>
    <condition id="STM32F7x9">
      <description>STMicroelectronics STM32F769/779 Series devices</description>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F779"/>
    </condition>
