mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
    <condition id="STM32F778_GCC">
      <description>filter for STM32F778 devices and the GCC compiler</description>
      <require condition="STM32F778"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F779_GCC">
      <description>filter for STM32F779 devices and the GCC compiler</description>
      <require condition="STM32F779"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F722_GCC">
      <description>filter for STM32F722 devices and the GCC compiler</description>
      <require condition="STM32F722"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F723_GCC">
      <description>filter for STM32F723 devices and the GCC compiler</description>
      <require condition="STM32F723"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F732_GCC">
      <description>filter for STM32F732 devices and the GCC compiler</description>
      <require condition="STM32F732"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F733_GCC">
      <description>filter for STM32F733 devices and the GCC compiler</description>
      <require condition="STM32F733"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F730_GCC">
      <description>filter for STM32F730 devices and the GCC compiler</description>
      <require condition="STM32F730"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F750_GCC">
      <description>filter for STM32F750 devices and the GCC compiler</description>
      <require condition="STM32F750"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="STM32F745_IAR">
      <description>filter for STM32F745 devices and the IAR compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F746_IAR">
      <description>filter for STM32F746 devices and the IAR compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F756_IAR">
      <description>filter for STM32F756 devices and the IAR compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F765_IAR">
      <description>filter for STM32F765 devices and the IAR compiler</description>
      <require condition="STM32F765"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F767_IAR">
      <description>filter for STM32F767 devices and the IAR compiler</description>
      <require condition="STM32F767"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F768_IAR">
      <description>filter for STM32F768 devices and the IAR compiler</description>
      <require condition="STM32F768"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F769_IAR">
      <description>filter for STM32F769 devices and the IAR compiler</description>
      <require condition="STM32F769"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F777_IAR">
      <description>filter for STM32F777 devices and the IAR compiler</description>
      <require condition="STM32F777"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F778_IAR">
      <description>filter for STM32F778 devices and the IAR compiler</description>
      <require condition="STM32F778"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F779_IAR">
      <description>filter for STM32F779 devices and the IAR compiler</description>
      <require condition="STM32F779"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F722_IAR">
      <description>filter for STM32F722 devices and the IAR compiler</description>
      <require condition="STM32F722"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F723_IAR">
      <description>filter for STM32F723 devices and the IAR compiler</description>
      <require condition="STM32F723"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F732_IAR">
      <description>filter for STM32F732 devices and the IAR compiler</description>
      <require condition="STM32F732"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F733_IAR">
      <description>filter for STM32F733 devices and the IAR compiler</description>
      <require condition="STM32F733"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F730_IAR">
      <description>filter for STM32F730 devices and the IAR compiler</description>
      <require condition="STM32F730"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F750_IAR">
      <description>filter for STM32F750 devices and the IAR compiler</description>
      <require condition="STM32F750"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7 CMSIS">
      <description>STMicroelectronics STM32F7 Device and CMSIS-CORE</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="STM32F7 Framework Classic">
      <description>STM32CubeF7 Classic Framework</description>
      <require condition="STM32F7"/>
      <require condition="STM32F7 HAL Common"/>
    </condition>

    <condition id="STM32F7 Framework CubeMX">
      <description>STM32CubeF7 Classic Framework</description>
      <require condition="STM32F7"/>
    </condition>

    <condition id="STM32F7 HAL Common">
      <description>STMicroelectronics STM32F7 Device and HAL Common</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>

    <condition id="STM32F7 HAL">
      <description>STMicroelectronics STM32F7 Device and HAL</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F7x6_7x7_7x8_7x9_750 HAL">
      <description>STMicroelectronics STM32F746/756/767/768/769/777/778/779/750 Device and HAL</description>
      <require condition="STM32F7x6_7x7_7x8_7x9_750"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F76x_77x HAL">
      <description>STMicroelectronics STM32F765/767/768/769/777/778/779 Device and HAL</description>
      <require condition="STM32F76x_77x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F7x8_7x9 HAL">
      <description>STMicroelectronics STM32F7x8/7x9 Device and HAL</description>
      <require condition="STM32F7x8_7x9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F7x7_7x8_7x9 HAL">
      <description>STMicroelectronics STM32F767/768/769/777/778/779 Device and HAL</description>
      <require condition="STM32F7x7_7x8_7x9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F756_777_779_750 HAL DMA">
      <description>STMicroelectronics STM32F756/777/779/750 Device and HAL</description>
      <require condition="STM32F756_777_779_750"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>

    <condition id="STM32F7 HAL GPIO">
      <description>STMicroelectronics STM32F7 Device and HAL with GPIO</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
