mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
    <condition id="STM32F769I-EVAL BSP EEPROM">
      <description>STMicroelectronics STM32F769I-EVAL BSP EEPROM</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP IO">
      <description>STMicroelectronics STM32F769I-EVAL BSP IO</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP LCD">
      <description>STMicroelectronics STM32F769I-EVAL BSP LCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP NOR">
      <description>STMicroelectronics STM32F769I-EVAL BSP NOR</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP QSPI">
      <description>STMicroelectronics STM32F769I-EVAL BSP QSPI</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP SD">
      <description>STMicroelectronics STM32F769I-EVAL BSP SD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP SDRAM">
      <description>STMicroelectronics STM32F769I-EVAL BSP SDRAM</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP SRAM">
      <description>STMicroelectronics STM32F769I-EVAL BSP SRAM</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F769I-EVAL BSP TS">
      <description>STMicroelectronics STM32F769I-EVAL BSP TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>

    <condition id="STM32F746G-Discovery LCD_RGB">
      <description>STMicroelectronics STM32F746G-Discovery LCD (RGB IF)</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Graphics Display" Cgroup="STM32F746G-Discovery" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32F746G-Discovery GLCD">
      <description>STMicroelectronics STM32F746G-Discovery GLCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32F746G-Discovery TS">
      <description>STMicroelectronics STM32F746G-Discovery TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Touch Screen"/>
    </condition>

    <condition id="STM32F746G-Discovery BSP">
      <description>STMicroelectronics STM32F746G-Discovery BSP</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP Audio">
      <description>STMicroelectronics STM32F746G-Discovery BSP Audio</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP Camera">
      <description>STMicroelectronics STM32F746G-Discovery BSP Camera</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP EEPROM">
      <description>STMicroelectronics STM32F746G-Discovery BSP EEPROM</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP LCD">
      <description>STMicroelectronics STM32F746G-Discovery BSP LCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP QSPI">
      <description>STMicroelectronics STM32F746G-Discovery BSP QSPI</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
