mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
    <condition id="STM32756G-EVAL BSP SDRAM">
      <description>STMicroelectronics STM32756G-EVAL BSP SDRAM</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32756G-EVAL BSP SRAM">
      <description>STMicroelectronics STM32756G-EVAL BSP SRAM</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32756G-EVAL BSP TS">
      <description>STMicroelectronics STM32756G-EVAL BSP TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL" doc="Documentation/DM00189702.pdf">STM32F7xx Hardware Abstraction Layer (HAL) Drivers</description>
    <description Cclass="Graphics Display">Display Interface including configuration for emWIN</description>
    <description Cclass="Board Support" Cgroup="Drivers">ST BSP Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" exclusive="1" Capiversion="1.0.0">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.2.4" condition="STM32F7 CMSIS">
      <description>System Startup for STMicroelectronics STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP_STM32F7XX    /* Device Startup for STM32F7 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32F7xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" condition="STM32F72x_73x_ARMCC" name="MDK/Device/Source/ARM/STM32F72x_73x_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32F74x_75x_ARMCC" name="MDK/Device/Source/ARM/STM32F74x_75x_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32F76x_77x_ARMCC" name="MDK/Device/Source/ARM/STM32F76x_77x_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32F72x_73x_ARMCC" name="MDK/Device/Source/ARM/STM32F72x_73x_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/>
        <file category="source" condition="STM32F74x_75x_ARMCC" name="MDK/Device/Source/ARM/STM32F74x_75x_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/>
        <file category="source" condition="STM32F76x_77x_ARMCC" name="MDK/Device/Source/ARM/STM32F76x_77x_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/>

        <!-- common device header file -->
        <file category="header"  name="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32F745_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f745xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F746_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f746xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F756_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f756xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F765_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f765xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F767_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f767xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F768_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f767xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F769_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f769xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F777_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f777xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F778_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f777xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F779_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f779xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F733_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f733xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F732_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f732xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F723_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f723xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F722_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f722xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F730_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f730xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F750_ARMCC" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/arm/startup_stm32f750xx.s" attr="config" version="1.2.2"/>
        <!-- GCC Toolchain -->
        <file category="source" condition="STM32F745_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f745xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F746_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f746xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F756_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f756xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F765_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f765xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F767_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f767xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F768_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f767xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F769_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f769xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F777_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f777xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F778_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f777xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F779_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f779xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F733_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f733xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F732_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f732xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F723_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f723xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F722_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f722xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F730_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f730xx.S" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F750_GCC"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/gcc/startup_stm32f750xx.S" attr="config" version="1.2.2"/>
        <!-- IAR Toolchain -->
        <file category="source" condition="STM32F745_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f745xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F746_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f746xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F756_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f756xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F765_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f765xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F767_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f767xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F768_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f767xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F769_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f769xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F777_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f777xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F778_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f777xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F779_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f779xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F733_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f733xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F732_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f732xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F723_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f723xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F722_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f722xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F730_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f730xx.s" attr="config" version="1.2.2"/>
        <file category="source" condition="STM32F750_IAR"   name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f750xx.s" attr="config" version="1.2.2"/>

        <!-- system file -->
        <file category="source" name="Drivers/CMSIS/Device/ST/STM32F7xx/Source/Templates/system_stm32f7xx.c" attr="config" version="1.2.2"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube Framework" Csub="Classic" Cversion="1.2.7" Capiversion="1.0.0" condition="STM32F7 Framework Classic">
      <description>Configuration via RTE_Device.h</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CLASSIC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/classic.html"/>
        <file category="header"  name="CMSIS/Driver/Config/RTE_Device.h" attr="config" version="1.5.1"/>
        <file category="header"  name="MDK/Templates/Inc/stm32f7xx_hal_conf.h" attr="config" version="1.2.7"/>
        <file category="source"  name="MDK/Templates/Src/stm32f7xx_hal_msp.c"  attr="template" select="MCU Specific HAL Initialization / De-Initialization"/>
        <file category="header"  name="MDK/Templates/Inc/stm32f7xx_it.h" attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="source"  name="MDK/Templates/Src/stm32f7xx_it.c" attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="header"  name="MDK/Templates/Inc/main.h" attr="template" select="'main' module for STM32Cube HAL"/>
        <file category="source"  name="MDK/Templates/Src/main.c" attr="template" select="'main' module for STM32Cube HAL"/>
        <file category="header"  name="MDK/Templates_LL/Inc/main.h" attr="template" select="'main' module for STM32Cube LL"/>
        <file category="source"  name="MDK/Templates_LL/Src/main.c" attr="template" select="'main' module for STM32Cube LL"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" Capiversion="1.0.0" condition="STM32F7 Framework CubeMX">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.2"/>
      </files>
    </component>

<!-- START: STMicroelectronics STM32CubeF7 HAL -->
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"    Cversion="1.2.7" condition="STM32F7 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32F7xx_HAL_Driver/Inc/"/>
        <file category="header"  name="Drivers/STM32F7xx_HAL_Driver/Inc/stm32f7xx_hal.h"/>
        <file category="source"  name="Drivers/STM32F7xx_HAL_Driver/Src/stm32f7xx_hal.c"/>
      </files>
    </component>
