mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/LED_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/Buttons_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="STM32F769I-Discovery TS">
        <description>Touchscreen Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/Touch_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F769I-Discovery GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32F769I_Discovery/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/GLCD_769I_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32F769I-Discovery LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F769I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/LCD_X.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
          <file category="header" name="Drivers/BSP/Components/otm8009a/otm8009a.h"/>
        </files>
      </component>
<!--
      <component Cgroup="Audio" Capiversion="1.1" condition="STM32F7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/Audio_746G_Discovery.c"/>
        </files>
      </component>
-->
    </bundle>

    <!-- STM32F769I-EVAL Board -->
    <bundle Cbundle="STM32F769I-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F769-EVAL Board</description>
      <doc>MDK/Boards/ST/STM32F769I_EVAL/Documentation/DM00276567.pdf</doc>
<!--
      <component Cgroup="Documentation" condition="STM32F7">
      <description>STM32F769I-EVAL BSP User Manual</description>
      <files>
        <file category="doc" name="Drivers/BSP/STM32F769I_EVAL/STM32F769I_EVAL_BSP_User_Manual.chm" />
      </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="Basic I/O" condition="STM32F769I-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio" condition="STM32F769I-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Camera" condition="STM32F769I-EVAL BSP Camera">
        <description>Camera for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_camera.c"/>
          <file category="source" name="Drivers/BSP/Components/s5k5cag/s5k5cag.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM" condition="STM32F769I-EVAL BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O" condition="STM32F769I-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD" condition="STM32F769I-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR" condition="STM32F769I-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_nor.c"/>
        </files>
      </component>
