mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/LED_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/Buttons_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="STM32F746G-Discovery TS">
        <description>Touchscreen Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/Touch_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F746G-Discovery GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32F746G_Discovery/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/GLCD_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32F746G-Discovery LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.1.0" condition="STM32F7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/Audio_746G_Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32756G-EVAL Board -->
    <bundle Cbundle="STM32756G-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32756G-EVAL Board</description>
      <doc>MDK/Boards/ST/STM32756G_EVAL/Documentation/DM00188617.pdf</doc>
<!--
      <component Cgroup="Documentation" condition="STM32F7">
      <description>STM32F756-EVAL BSP User Manual</description>
      <files>
        <file category="doc" name="Drivers/BSP/STM32756G_EVAL/STM32756G_EVAL_BSP_User_Manual.chm" />
      </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="Basic I/O" condition="STM32756G-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio" condition="STM32756G-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
          <file category="library" condition="CM7_LE_ARMCC"  name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7F_LE_ARMCC" name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7_LE_GCC"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7F_LE_GCC"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7_LE_IAR"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
          <file category="library" condition="CM7F_LE_IAR"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Camera" condition="STM32756G-EVAL BSP Camera">
        <description>Camera for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_camera.c"/>
          <file category="source" name="Drivers/BSP/Components/s5k5cag/s5k5cag.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM" condition="STM32756G-EVAL BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O" condition="STM32756G-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD" condition="STM32756G-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR" condition="STM32756G-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI" condition="STM32756G-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD" condition="STM32756G-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM" condition="STM32756G-EVAL BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM" condition="STM32756G-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen" condition="STM32756G-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32756G_EVAL/stm32756g_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
          <file category="source" name="Drivers/BSP/Components/ts3510/ts3510.c"/>
          <file category="source" name="Drivers/BSP/Components/exc7200/exc7200.c"/>
        </files>
      </component>
