mdhardenburgh/Blinky/Packages/.cache/Keil.STM32F7xx_DFP.2.12.0.pdsc
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/LED_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Buttons_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F7 HAL GPIO ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/ADC_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32756G-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Joystick_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="STM32756G-EVAL TS">
        <description>Touchscreen Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Touch_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32756G-EVAL GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32756G_EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/GLCD_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32756G-EVAL LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.1.0" condition="STM32F7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Audio_756G_EVAL.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32F769I-Discovery" Cvariant="RGB IF" Cversion="1.0.2" condition="STM32F7 HAL LTDC DMA2D DSI OTM8009A Graphics LCD_RGB">
      <description>LCD Configuration for STM32F769I-Discovery LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_Discovery/Common/LCDConf.c" attr="config" version="1.1.1"/>
      </files>
    </component>
    <component Cclass="Graphics Display" Cgroup="STM32F769I-EVAL" Cvariant="RGB IF" Cversion="1.0.2" condition="STM32F7 HAL LTDC DMA2D DSI OTM8009A Graphics LCD_RGB">
      <description>LCD Configuration for STM32F769I-EVAL LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/LCDConf.c" attr="config" version="1.1.1"/>
      </files>
    </component>
    <component Cclass="Graphics Display" Cgroup="STM32F746G-Discovery" Cvariant="RGB IF" Cversion="1.0.2" condition="STM32F7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32F746G-Discovery LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/LCDConf.c" attr="config" version="1.1.1"/>
      </files>
    </component>
    <component Cclass="Graphics Display" Cgroup="STM32756G-EVAL" Cvariant="RGB IF" Cversion="1.0.2" condition="STM32F7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32756G-EVAL LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/LCDConf.c" attr="config" version="1.1.1"/>
      </files>
    </component>
  </components>

  <boards>
    <!-- STM32F769I-Discovery -->
    <board vendor="STMicroelectronics" name="STM32F769I-Discovery" revision="Rev.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32F769I-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F769I_Discovery/Documentation/stm32f769i-disco_small.jpg"
             large="MDK/Boards/ST/STM32F769I_Discovery/Documentation/stm32f769i-disco_large.jpg"/>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/32f769idiscovery.html" title="STM32F769I_Discovery Web Page"/>
      <!--book category="setup"     name="Documentation/32F746GDISCOVERY_QSG.pdf" title="STM32F746G-Discovery Quick Start Guide"/-->
      <!--book category="manual"     name="Drivers/BSP/STM32F769I-Discovery/STM32F769I-Discovery_BSP_User_Manual.chm" title="BSP User Manual"/-->
      <!--book category="setup"      name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00092826.pdf" title="Getting Started"/> -->
      <book category="schematic" name="MDK/Boards/ST/STM32F769I_Discovery/Documentation/stm32f769i-disco_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F769I_Discovery/Documentation/DM00276557.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F769I_Discovery/Documentation/stm32f769i-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F769I_Discovery/Documentation/stm32f769i-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F769NIHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F769"/>
      <feature type="ODbg"      n="1"                name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="25000000"/>
      <feature type="RAM"       n="1"                name="128-Mbit SDRAM (64 Mbits accessible)"/>
      <feature type="ROM"       n="1"                name="512-Mbit Quad-SPI Flash memory"/>
      <feature type="MemCard"   n="1"                name="microSD card holder"/>
      <feature type="PWR"       n="5"                name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"         name="External Supply"/>
      <feature type="USB"       n="1"                name="USB OTG HS with micro-AB Connector"/>
      <feature type="ETH"       n="1"  m="100000000" name="RJ54 Jack"/>
      <feature type="I2C"       n="1"                name="I2C extension connector"/>
      <feature type="Button"    n="2"                name="Push-buttons: User and Reset"/>
      <feature type="LineIn"    n="1"/>
      <feature type="LineOut"   n="1"/>
      <feature type="MIC"       n="4"                name="ST MEMS microphones"/>
      <feature type="ConnOther" n="1"                name="SPDIF RCA input connector"/>
      <feature type="ConnOther" n="1"                name="SPDIF RCA output connector"/>
      <feature type="Speaker"   n="1"                name="Stereo speaker outputs"/>
      <feature type="GLCD"      n="1" m="800.480"    name="Color TFT LCD with capacitive touch screen"/>
      <feature type="CustomFF"  n="80" m="130"       name="Discovery Board Formfactor"/>
      <feature type="ArduinoFF" n="1"                name="Arduino Uno 3V connectors"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

